tutorials/multiphase/interPhaseChangeDyMFoam/propeller/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0];

internalField   uniform 1e5;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        phi             phiAbs;
        value           $internalField;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outerCylinder
    {
        type            fixedFluxPressure;
        phi             phiAbs;
        value           $internalField;
    }

    "propeller.*"
    {
        type            fixedFluxPressure;
        phi             phiAbs;
        value           $internalField;
    }
}


// ************************************************************************* //
